/* 小程序选项卡数据 */
var wx_data = [
    {
        "id": 1,
        "name": "联途汇率换算",
        "developer": "修道人",
        "type": "实用工具",
        "url": "1.png",
        "url2": "1.1.jpg",
        "date": "2017-1-1",
        "info": "联途汇率换算,是一款界面简约,操作简单,上手快捷,数据即时的汇率换算工具,支持人民币汇率,美元汇率等多达154种货币."
    }
    ,
    {
        "id": 2,
        "name": "贝塔基金宝",
        "developer": "513868087",
        "type": "金融理财",
        "url": "2.jpg",
        "url2": "2.1.jpg",
        "date": "2017-1-1",
        "info": "协助投资人可视化展示各类金融产品(基金,私募,集合计划,保险,理财,投资人物等),科学分析客户持仓资产和配置,让我们的投资有据可查."
    }
    ,
    {
        "id": 3,
        "name": "今日汇率",
        "developer": "Soup",
        "type": "社交生活",
        "url": "3.jpg",
        "url2": "3.1.jpg",
        "date": "2017-1-1",
        "info": "[今日汇率]超级方便稳定的汇率查询换算工具,YAHOO金融数据同步,真的很方便."
    }
    ,
    {
        "id": 4,
        "name": "省呗",
        "developer": "省呗",
        "type": "金融理财",
        "url": "4.jpg",
        "url2": "4.1.png",
        "date": "2017-1-1",
        "info": "为你私人订制的刷卡优惠信息,最优惠的信用卡还款方式!省呗还可以帮你垫付信用卡还款,用省呗还信用卡,利率仅是银行最低还款利率的六折.如果你还在为每月的信用卡账单而烦恼,为每月只能偿还信用卡的最低还款而支付大额利息心痛不已,省呗也许是你正在寻找的,我们可以帮你改变这些窘境."
    },
    {
        "id": 5,
        "name": "房贷计算器免费版",
        "developer": "金雨",
        "type": "金融理财",
        "url": "5.jpg",
        "url2": "5.1.jpg",
        "date": "2017-1-1",
        "info": "免费房贷工具,2017买房卖房必备.全面覆盖公积金贷款,商业贷款,组合贷款,利率实时调整,买房卖房专业房贷计算好帮手!"
    }
    ,
    {
        "id": 6,
        "name": "同程旅游",
        "developer": "同程旅游",
        "type": "社交生活",
        "url": "6.jpg",
        "url2": "6.1.jpg",
        "date": "2017-1-1",
        "info": "同程小程序是一款无需下载安装,只需扫描二维码即可实现产品订购和增值服务的应用,目前开放了火车票,飞机票,汽车票,酒店,景点等多个产品入口,并已全部完成小程序的搭建.在不久的将来,用户在到达火车站.机场,汽车站,景区,门店等场景时,可轻松实现扫码购票和到场服务.同程致力于打造不同场景的差异化服务,将对旗下产品做出全线智慧升级,以更丰富多元的产品,依托小程序,领跑智慧出行."
    }
    ,
    {
        "id": 7,
        "name": "微寄递",
        "developer": "广州邮政",
        "type": "社交生活",
        "url": "7.png",
        "url2": "7.1.jpg",
        "date": "2017-1-1",
        "info": "用户可以随时随地线上下单,选择上门取件或到附近蜜蜂箱投件,以及在线查询邮件,服务网点等信息."
    }
    ,
    {
        "id": 8,
        "name": "喜鹊社区app",
        "developer": "advadr",
        "type": "社交生活",
        "url": "8.jpg",
        "url2": "8.1.jpg",
        "date": "2017-1-1",
        "info": "喜鹊社区,温暖的小区邻里社区,这里有你身边最亲近的邻居,还有小区里最温馨的画面.这里没有纠纷争吵,只有谦让,尊敬,互助.孩子们一起玩耍一起长大,大人们一起生活一起促进,让近邻成为近亲."
    }
    ,
    {
        "id": 9,
        "name": "小云喇叭",
        "developer": "yunlaba",
        "type": "影音娱乐",
        "url": "9.png",
        "url2": "9.1.jpg",
        "date": "2017-1-1",
        "info": "快递,物流."
    }
    ,
    {
        "id": 10,
        "name": "食物派Lite",
        "developer": "itisalex",
        "type": "社交生活",
        "url": "10.jpg",
        "url2": "10.1.jpg",
        "date": "2017-1-1",
        "info": "查询食物营养信息,热量(卡路里),碳水化合物,脂肪,蛋白质.减肥健身饮食必备."
    }
    ,
    {
        "id": 51,
        "name": "一键加油",
        "developer": "阿灿",
        "type": "实用工具",
        "url": "51.jpg",
        "url2": "51.1.png",
        "date": "2017-1-9",
        "info": "快捷便宜的汽车加油工具."
    }
    ,
    {
        "id": 53,
        "name": "食物派Lite",
        "developer": "itisalex",
        "type": "实用工具",
        "url": "53.jpg",
        "url2": "53.1.jpg",
        "date": "2017-1-9",
        "info": "查询食物营养信息,热量(卡路里),碳水化合物,脂肪,蛋白质.减肥健身饮食必备."
    }
    ,
    {
        "id": 54,
        "name": "解忧室",
        "developer": "ifanr",
        "type": "实用工具",
        "url": "54.jpg",
        "url2": "54.1.jpg",
        "date": "2017-1-9",
        "info": "用手机遇到奇怪的问题不知道怎么办?我来帮你解答."
    }
    ,
    {
        "id": 55,
        "name": "斗图表情包神器",
        "developer": "重庆七步科技有限公司",
        "type": "实用工具",
        "url": "55.png",
        "url2": "55.1.jpg",
        "date": "2017-1-9",
        "info": "斗图表情包-轻松制作最硬最low最抢眼的表情包.使用斗图表情包神器,斗图永远不会输.Gif 动效 搞笑 趣味 娱乐都不能少."
    }
    ,
    {
        "id": 56,
        "name": "亲戚关系",
        "developer": "六坤",
        "type": "社交生活",
        "url": "56.png",
        "url2": "56.1.jpg",
        "date": "2017-1-9",
        "info": "亲戚关系是一款最全面的中国亲戚关系计算器,走亲访友,逢年过节必备神器,避免叫错,不会叫亲戚的尴尬,人人必备亲戚关系工具."
    }
    ,
    {
        "id": 11,
        "name": "得到 plus",
        "developer": "快刀青衣",
        "type": "教育学习",
        "url": "11.png",
        "url2": "11.1.jpg",
        "date": "2017-1-1",
        "info": "得到plus是罗辑思维团队出品的知识服务小程序,每天提供高质量的知识新闻和书籍精华,帮助用户缓解知识焦虑症."
    }
]

var type1 = [], type2 = [], type3 = [], type4 = [], type5 = [];
(function () {
    for (var i = 0; i < wx_data.length; i++) {
        if (wx_data[i].type == "实用工具") {
            type1.push(wx_data[i]);
        } else if (wx_data[i].type == "社交生活") {
            type2.push(wx_data[i]);
        } else if (wx_data[i].type == "金融理财") {
            type3.push(wx_data[i]);
        } else if (wx_data[i].type == "影音娱乐") {
            type4.push(wx_data[i]);
        } else if (wx_data[i].type == "教育学习") {
            type5.push(wx_data[i]);
        }
    }
})()


/* 新闻信息数据 */
var news_data = [
    {
        "id": 1,
        "name": "【修真院“善良”系列之十二】小程序时代的风暴",
        "url": "news1.jpg",
        "developer": "葡萄藤",
        "date": "2017/1/11",
        "sinfo": "微信小程序正式公布后，一石激起千层浪，业内瞬间热闹起来。在小程序拨开云雾始见青天的过程中,仍然有很多人并不清楚: 什么是小程序?会对我们的生活、工作有什么影响?会带来什么变化、 真正用起来的感觉如何,对互联网行业、 移动生态格局意味着什么?接下来我们一一作答。",
        "info": '<section class="entry-content g-binding ng-scope" ng-bind-html="postContentTrustedHtml" ui-copyright-check="" data-entry-url="/p/24815972" data-author-name="萌萌大白" ng-if="ownPost(post) || !isCensoring"><p><b><u>&gt;&gt;&gt;&gt;前言</u></b></p><p>微信小程序正式公布后，一石激起千层浪，业内瞬间热闹起来。在小程序拨开云雾始见青天的过程中,仍然有很多人并不清楚: 什么是小程序?会对我们的生活、工作有什么影响?会带来什么变化、 真正用起来的感觉如何,对互联网行业、 移动生态格局意味着什么?接下来我们一一作答。</p><p><b><u>&gt;&gt;&gt;&gt;什么是小程序</u></b></p><p>“小程序是这一种不需要下载安装即可使用的应用，它实现了应用“触手可及”的梦想，用户扫一扫或者搜一下即可打开应用。也体现了“用完即走”的理念，用户不关心是否安装太多应用的问题。应用将无处不在，随时可用，但又无需安装卸载。”——张小龙</p><p><b><u>&gt;&gt;&gt;&gt;小程序与APP的区别</u></b></p><p>相比于APP的大而全，小程序带给我们的便是体验上的小而美。<br></p><p>1、<b>少了安装APP的麻烦</b></p><p>在 app 时代,如果我们要使用一项功能,通常需要完成以下步骤: 在 App Store 或 Android 应用市场,寻找能实现相应功能的应用;→下载并安装该应用;→在手机桌面,找到应用;→打开并使用应用。</p><p>而在小程序时代,只需要搜索或者「扫一扫」,即可打开应用。没有了下载安装环节,人和功能的连接变得更加简单直接。<br></p><p>2、<b>释放手机内存</b></p><p>相比于一个小则几十M，大则几个G的APP，小程序大小不超过 1 M 的优势迅速凸显出来，为大家的手机大大减轻负担。当之无愧成了手机内存不够用的救星。</p><p>3、<b>让手机桌面更简洁</b></p><p> 小程序问世后,也许,你手机桌面上的许多 app 将会消失。 你不会为了临时打车，医院挂号，寄个快件而相应下载一连串APP了，从今以后，这些功能简单、使用频率低的 app 将会被小程序替代。它们都将陆续收录到微信这个”大APP“里，当然也预示着你加强了对微信的依赖和粘度。<br></p><p><b><u>&gt;&gt;&gt;&gt;小程序与HTML5的区别</u></b></p><p>首先需了解这是两种不同的东西:小程序 是计算机程序,而<b>HTML 5 </b>则是互联网网页。</p><p>1、<b>对用户而言</b></p><p>我们打开 HTML 5,实际上是打开一个网页,而网页需要在浏览 器中渲染。所以,在微信上点开 HTML 5,需要完成网页加载的步骤,这就 会给人一种”卡“的感觉。</p><p>而对于微信小程序来说,它的代码可以直接在微信上运行,省去 了通过浏览器渲染的步骤,在体验上会胜过 HTML 5 不少。总而言之,在微信中使用小程序,会比 <b>HTML 5 </b>流畅很多。</p><p>2、<b>对开发者而言</b></p><p>对开发者而言对于开发者来说,相比<b>HTML 5</b>,小程序可以节省大量的服务器资源。那是因为,HTML 5 需要开发者的服务器向用户发送 HTML 5 代码,而微信会帮开发者分发他们的小程序。</p><p><br><b><u>&gt;&gt;&gt;&gt;小程序与订阅号，服务号的区别</u></b></p><p>同属于微信的生态体系,小程序也被很多人拿来跟订阅号、服务 号比较。那么,它们之间到底有什么区别呢?</p><p>1、<b>订阅号：</b>是用户用来获取信息，满足企业营销目的一种媒体属性的产品。</p><p>2、<b>服务号：</b>提供基本的客户服务（买卖、售后、咨询等），让用户直接与机 构的客服系统进行沟通、为用户􏰀供品牌信息等，同时也辅助企业变现。</p><p>3、<b>小程序</b><b>：</b>以上两者都是以”聊天界面”为基础的,即是说,它们的功能和界面是早就规定好了的。而小程序允许开发者自定义界面,开发者可以􏰀供更好的使用体验。从运营上来看，小程序升华用户的场景化应用，进一步连接企业和用户，锁死用户。</p><p><u><b>&gt;&gt;&gt;&gt;小程序的入口</b></u></p><p>首先，将你的微信 <b>升级到最新6.5.3版本</b>，安卓及iOS系统同步。</p><p>1、在微信搜索栏搜索"小程序示例"。 （注意：搜索没有模糊匹配，比如搜索"视频""外卖"，用户并不能找到相应的小程序，只有搜索"腾讯视频""美团外卖"等准确的小程序命名，才能找到小程序。）你也可以选择通过<a href="https://link.zhihu.com/?target=http%3A//xiao.ptteng.com/" class=" wrap external" target="_blank" rel="nofollow noreferrer">小程序大全<i class="icon-external"></i></a>，分类搜索出更全更精准的小程序应用。</p><p>2、关闭"小程序示例"后，你就可以在微信"<b>发现</b>"一栏看到"<b>小程序</b>"的入口了。如下图所示。</p><br><p>3、<b>线下扫码，</b>在特定的场景下通过扫描二维码进入对应的小程序，这也是官方所提倡的一种方式。目前，<b>小程序的二维码不支持在微信中长按识别</b>，只能通过微信扫一扫，才能开启小程序。</p><p>4、<b>微信搜索：</b>在微信客户端最上方的搜索窗口，你可以通过搜索获取一个小程序。关闭"小程序示例"后，你就可以在微信"<b>发现</b>"一栏看到"<b>小程序</b>"的入口了。</p><p>5、<b>好友推荐：</b>当你发现一个好玩的或者实用的小程序，可以将这个小程序，或者它的某一个页面转发给好友或群聊。</p><p>6、<b>关联公众号：</b>同一主体的小程序和公众号可以进行关联，并相互跳转，该功能需要经开发者自主设置后使用。</p><p>7、<b>好友推荐：</b>当你发现一个好玩的或者实用的小程序，可以将这个小程序，或者它的某一个页面转发给好友或群聊。但是注意，<b>小程序无法在朋友圈中发布分享。</b></p><p>8、<b>历史记录：</b>当你使用过某个小程序后，在微信客户端的"发现-小程序"里的列表，就可以看到这个小程序，想要再次使用它时，通过列表中的历史记录就可以进入。</p><p><b><u>&gt;&gt;&gt;&gt;小程序将带来哪些改变</u></b><br></p><p>1、<b>对行业的影响：</b>小程序的服务范围包含 17 个行业。如果你所在的行业名列其中, 恭喜你自动获得了小程序的入场券。</p><p>2、<b>线下门店：</b>每个线下门店,如餐馆、服装店、旅店,不一定能拥有自己的 app 和网站。但每个线下门店,都可以拥有自己的小程序:它能实现 app 和网 页的功能,且开发成本更低,用户使用起来也更方便。</p><p><b>场景1：</b>下班后，你想去一个饭店请同事吃饭，但是按以往的规律来看，这个时间点肯定是要排队的。如果你提前准备了一个排队小程序一切就ok了，让小程序替你排队取吧！你只需要让它提前10分钟通知你就行。</p><p><b>场景2：</b>快吃完饭了，你们决定打车回家，但是正值高峰期，出租车很少，于是你和同事点开一款打车小程序，约了5分钟后到饭店门口的车，这样便节省了等车的。</p><p>3、<b>低频刚需的行业领域：</b>比如打车，医院挂号，点餐，寄快件等低频刚需的领域，用户更追求简单上手用完即走的体验，传统下载APP就会给用户造成较大的使用门槛，而微信小程序“小”的形态,可以很好地进行承载。处在低频刚需行业领域的公司,可以以更低的成本供体验更好的 小程序;而用户也不再担心“使用一次服务就要装一个app”的情况 了,他们只需要扫一下二维码,就能在以后轻松使用这些服务。</p><p>4、<b>对IT职业的影响：</b>对前端工作者而言，有人惊呼，小程序推出简直就是“前端工程师的春天”。的确,从网页前端迁移至小程序开发几乎零成本。不仅如此,小程序的 MINA 框架可以让前端开发在同等的开 发时间里,开发出体验更棒的网页。微信已经将小程序的接口封装得很好,前端开发 者在开发的时候,只需要简单几行代码,就能轻松调用它们。</p><p>5、<b>对用户的影响：</b>如果你只是一个既不会写代码,又不用操心企业经营的吃瓜群众。你的手机将变得更加好用、更加强大:不用装 app,也能实现很多平时所需的功能。“一些放在桌面累赘，又不能没有的APP终于有归宿了”，尤其是只有16G内存的手机无疑是一个福音，很多应用大小不超过1M的小程序就可以搞定。这是对于微信小程序给用户带来的价值的主要论调。它们拥有了比以往更多的选择权。用户选择应用的保存方式更多的是从手机配置、认知习惯、使用爱好等几方面来选择，如果您希望用户选择APP，意味着您需要提供更多有价值的内容来抵消占用他们手机内存的不悦；如果您希望他们选择小程序，意味着您的小程序能够以最简单的方式完成用户的需求。</p><br><p>—————————————————————————————————————————</p><br><p>你可以：</p><p>关注修真院正在完善ing的<a href="https://link.zhihu.com/?target=http%3A//xiao.ptteng.com/" class=" wrap external" target="_blank" rel="nofollow noreferrer">小程序大全<i class="icon-external"></i></a></p><p>关注修真院官方微信：<b>葡萄藤IT技能树</b></p><p>关注官方网站：<a href="https://link.zhihu.com/?target=http%3A//www.jnshu.com/home" class=" wrap external" target="_blank" rel="nofollow noreferrer">修真院<i class="icon-external"></i></a></p><p>加入IT修真院学习QQ群  </p><p>1群：2000人  185354188（已满）</p><p>2群：1000人  424031650（已满）</p><p>3群：500人    493806441（已满）</p><p>4群：500人   580626624</p><p>6群：500人   604640559</p></section>'
    },
    {
        "id": 2,
        "name": "9000字实操指南：换个姿势深入微信小程序",
        "url": 'news5.png',
        "developer": "Jinkey",
        "date": "2017/01/12",
        "sinfo": '本文作者将从技术层面为你解析小程序到底是什么、小程序的入口和小程序应用场景，以及探讨了该不该做小程序的问题，甚至还分享了小程序的一些要点。小编看完后，一脸萌...',
        "info": '<div class="entry-content"> <blockquote><p>本文作者将从技术层面为你解析小程序到底是什么、小程序的入口和小程序应用场景，以及探讨了该不该做小程序的问题，甚至还分享了小程序的一些要点。小编看完后，一脸萌比……</p></blockquote> <p><img data-action="zoom" class="size-full wp-image-575143 aligncenter" src="http://image.woshipm.com/wp-files/2017/01/3ITtAcsVBut4tjuXlxCF.png" alt="" width="680" height="320"></p> <h2>前言</h2> <blockquote><p>Q： Jinkey, 可以概括一下小程序吗？</p> <p>A：这也不行，那也不行</p> <p>Q：丫的，你能不能正经点……</p> <p>A：用完就滚</p> <p>Q：……</p> <p>Q：为什么说小程序如炮友？</p> <p>A：小程序刚发布不久就流行一个段子：APP 如原配，一年不用几次；服务号如情人，一个月固定几次；订阅号如酒店小卡片，天天可以卖广告；小程序像炮友，用完就走。</p></blockquote> <p>资本如嫖客，各个平台和垂直类掠夺者已经瓜分掉了线上流量，那么未来争夺的流量战场必然在实体场景，很多巨头其实已经证明了线下流量庞大的潜力。在快递包裹上印上自己的二维码关注公众号形成二次寄出快递的粘性，Pokemon Go 让用户在实体地图上捕获小精灵。</p> <p>未来的入口不限于二维码，而是一切的富媒体。二维码之于2D识别，复杂图案之于 AR，语音指令之于 Siri，会发射信号的一个芯片；使用这些入口的不限于人类，对这些入口的识别，除了人扫二维码，还有无人驾驶汽车识别路标，寻找实体商店坐标；智能助手根据主人偏好自动在电商平台寻找合适的商品并且下单。</p> <p>一句话来说，<strong>未来的流量来自线下，流量的入口来自多媒体，整个战场会从移动互联网到“实体互联网”转变，作为后续的“物联网”全民化的过渡。</strong></p> <p>那么小程序之于微信，就是利用二维码这种富媒体（图像），把线下商家的流量聚拢到微信。另外，从微信的服务类目看，这将是腾讯向成为互联网水和电的目标的又一大步，下文会进一步分析。</p> <h2>目录</h2> <p>1. 企业注册流程</p> <p>2. 小程序到底是什么</p> <p>3. 小程序的入口</p> <p>4. 小程序应用场景</p> <p>5. 该不该做小程序（&lt;重后端，轻前端&gt; 的思想、小程序和H5 的区别、红利期、小程序类目）</p> <p>6. 一些要点</p> <p>7. 小程序的能力（自带组件、事件、硬件能力、微信能力）</p> <h2>一、企业注册流程</h2> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/1ZBkMeAxj3MQqjvwyadT.jpg" alt="" width="807" height="236"></p> <h2>二、小程序是到底是什么</h2> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/tF1PWBna3baxcWzCRyyr.jpg" alt="" width="802" height="448"></p> <p>小程序写的时候用的是 javascript 这种网页开发语言，首次运行会把这个“网页”缓存到本地，所以不是不用下载，而是下载的包比较小而已。然后通过 Android 或 iOS 各自的 JSBridge 方法转换成对应的 Java 或 Objective-C 方法运行。</p> <p>比如我在小程序写了一个方法：</p> <p><img data-action="zoom" class=" wp-image-575102 aligncenter" src="http://image.woshipm.com/wp-files/2017/01/6dzUKWBmc1qV0iyn7HcU.png" alt="" width="802" height="169"></p> <p>程序就会识别出wx.showToast及其参数（文字、图标、持续事件），然后执行本地的一个方法：</p> <p><img data-action="zoom" class=" wp-image-575103 aligncenter" src="http://image.woshipm.com/wp-files/2017/01/12u6DXQjbGi0vpWzlgEm.png" alt="" width="798" height="51"></p> <p>弹出一个原声的 Toast 组件，上说只是为了方便说明，实际运行环境会复杂的多。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/Z6FiXUYoVxR4wa7Ct62k.jpg" alt="" width="803" height="454"></p> <p>上图左边是大家在微信公开课 Pro 会场上看到的企微云平台的快销上报小程序，看上去真的很像一个独立 App，虽然我看不到他的源代码，但是我试着还原其中一个页面来举例子。</p> <p>一个页面都是一个独立的文件夹（微信开发者工具会自动为你创建），每新增一个页面需要在 app.json 文件的 pages 列表新增一项。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/B0xqtqA5Vyh7R3APumdy.jpg" alt="" width="428" height="228"></p> <p>一般来说，src 目录建议用来放置固定的一些企业介绍视频或者宣传图片等等<strong>（整体的包大小不能超过1M）。</strong></p> <p>如果你不放在这个目录，也可以放在你自己的服务器，远程访问。比如一些经常变化的活动宣传 banner</p> <p>app.json 是可以配置整个程序的<strong>底部导航 tab、导航栏的背景颜色</strong>（貌似不能弄成图片，如果希望做成京东 app 超级品牌日那种全屏氛围渲染，建议banner 图片上半部分使用渐变色过渡到你配置的状态栏背景颜色）<strong>、导航栏标题、导航栏颜色、是否支持下拉刷新</strong>等。</p> <p>app.js 是全局的一些方法，比如<strong>获取用户信息</strong>，全局数据的配置地方。</p> <p>js 会部分转成原生的 java 和 oc 代码执行，那么页面呢？用的是操作系统原生的组件吗？带着这个疑问用 UI 测试工具打开了微信：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/4TiR93ZqgeZb8wt6I8xK.jpg" alt="" width="702" height="459"></p> <p>你们看到有一个 YYWKWebview 的东西了吗？WKWebview是原生的一个浏览器控件，相当于只是用小程序打开了一个下载好的本地网页。而且用了类似 weex/vue 那样子的技术，所以页面切换非常流程。（可以自行百度一下 阿里weex）</p> <p>上面看到每个页面都是一个文件夹，那么里面的四个文件都是干什么的呢？</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/Oe3aAJrU9pTuJqFFwfac.jpg" alt="" width="797" height="448"></p> <p>.json 是配置文件。就好比是你的简历，上面写了名字、毕业时间等，而小程序的 json会记录一些信息：<strong>导航栏背景颜色、导航栏标题颜色、导航栏标题文字内容、窗口的背景色、下拉背景字体、loading 图的样式、是否开启下拉刷新、页面整体能不能上下滚动</strong>。</p> <p>.wxml 是页面的基本骨架。就像骨架规定了人的大概模样一般，wxml 是一种类 xml 的结构化文本，<strong>描述了小程序页面有哪些元素</strong>。比如一个文章需要有标题、作者、时间、正文，但是不关心这些元素怎么排列。</p> <p>.js 也就是 javascript 这种前端脚本语言的文件。要人的四肢东西来，怎么动，就需要大脑和肌肉控制，小程序从“骨架”成为“血肉之躯”的正是 js 的作用。js 做一些动态的东西，比如<strong>请求数据，控制元素上下移动，判断用户输入密码是否安全等等</strong>。</p> <p>.wxss 就是决定整个<strong>页面元素的颜色等表现形式</strong>。好比同一个人可以穿不同的衣服，化不同的妆，看上去也就不一样了。在 wxml 文件中同样写了一个按钮，但可以给他配置不同的背景颜色：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/9JSvVOTqN9RipUI6j3sI.jpg" alt="" width="600" height="157"></p> <h2>三、小程序的入口</h2> <h3><strong>线下实体（商铺、停车场、政府服务窗口等）</strong></h3> <p>比如这个微信公开课给出的场景例子，我来 YY一下。</p> <blockquote><p>在停车场的入口，有一个摄像头对着你的车牌号码，当你扫码打开小程序时，点击开始停车，如果有空余车位，系统会自动打开闸门并记录开始停车的时间。这时候小程序会展示室内地图，引导你先左转再右转到达目标车位，停好车走人。等你来取车的时候，开车到闸门口，再次扫描二维码或直接从历史记录打开小程序，选择结束停车，调起微信支付，停车场摄像头识别车牌号码，打开闸门放行。</p></blockquote> <p>整个过程无需取停车卡和专职工作人员服务，环保也节省人力成本。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/fzGQA3pyHIFkiWFqdfh6.jpg" alt="" width="450" height="337"></p> <h3><strong>线上PC导航站</strong></h3> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/XTb23Gr8TFxxEVcoKGyl.jpg" alt="" width="638" height="540"></p> <h3><strong>移动导航站</strong></h3> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/h9VrvwE8vD5HoIJ28jm1.jpg" alt="" width="663" height="287"></p> <h3><strong>微信群分享</strong></h3> <p>性冷淡风格（从程序介绍页分享出来）</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/UrFsacPdWF6VxO0VmXMH.jpg" alt="" width="401" height="156"></p> <p>欲罢不能的风格（从程序内页分享出来）</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/zIC6Botrw8iwF9Sp0isi.jpg" alt="" width="401" height="432"></p> <h3><strong>关键词精准搜索</strong></h3> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/ATn5SAVWizfiulXQkWVU.jpg" alt="" width="401" height="149"></p> <h3><strong>发现入口</strong></h3> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/8pkFbqjkOsVIKrLjmUcY.jpg" alt="" width="700" height="402"></p> <h3><strong>聊天列表顶部</strong></h3> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/hXldpxTCGpwmwiLVBcSo.jpg" alt="" width="304" height="112"></p> <h2>四、小程序应用场景</h2> <p>应用场景主要分为<strong>微信群协作</strong>和<strong>实体服务</strong>。</p> <h3><strong>微信群协作</strong></h3> <p>微信群协作主要是一些企业内部服务的或者工作上的沟通。</p> <p>问卷投票：公司要开展年会了，做那个活动好呢？通过小程序发布的投票并且分享到群里，可以实时看到前三名。</p> <p>会议助手：临时召开紧急会议，需要相关人尽快确定参会情况，往群里抛一个开会通知小程序，特定的人才能打开了解会议内容并确认，谁参加谁请假，参与人数多少一目了然。活动时间点到了，还可通过小程序的消息服务能力给参会人发送参会提醒；到了参会现场打开小程序就能签到，真正意义上的需要用时就用，用完就走。</p> <p>虽然很多办公场景用企微的微信企业号组件也可以做到，但是并不是每个企业都有一个企业号，对于普通小公司小团队来说，这些能力还是做到小程序上快捷方便。</p> <h3><strong>实体服务</strong></h3> <p>睡觉前，扫描一下床头的二维码贴，打开“Jinkey 外卖”，下单叫了一个早餐外卖，然后扫描一下“JJ 智能家居”小程序二维码，检测到现在是晚上，自动关灯。跟 siri （iOS 智能语音助手）说一句，“晚安，明天7点叫我起床哦”，然后美美地睡上一觉。</p> <p>第二天，siri 把我叫了起床，等了一会，早餐也送到了，吃完，打开微信聊天窗口的小程序服务通知，点开早餐外卖支付成功的模板消息，进入“Jinkey 外卖”的小程序页给了个差评（要收钱的还不给差评？！哈哈哈）。吃完早餐就出门。</p> <p>昨天车放在公司了，那今天就骑车吧，在楼下找到肉色的自行车，打开 摸拜单车 的小程序，扫一扫完成了开锁，骑上去，愉快地回到公司。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/bCP91wziTOgWU1TdlvcK.jpg" alt="" width="304" height="342"></p> <p>来到公司打开，签到小程序，扫一下公司前台动态变化的二维码，同时小程序识别出我的地理位置，打卡成功！回到座位上开始奋斗的一天。</p> <p>中午吃饭，同事都说饿了吧外卖有优惠。那赶紧打开饿了吧小程序，黄焖鸡30元免运费，于是我发起了一个组团买，然后把这个页面分享到公司群，小伙伴们点进去页面选择自己要的套餐，各自支付完成后，分别都收到了一条“付款成功，正在配送”的模板消息。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/6ko9uvyQrMB4LF2UCDBm.jpg" alt="" width="304" height="342"></p> <p>然后小程序上还可以实时看到外卖小哥去到哪里了，超级贴心的。</p> <p>中午睡觉，插上耳机，打开小睡眠小程序听着舒适的背景音乐。</p> <p>下班的时候可以开车咯，到地下车库取车，开车到闸门口，再次扫描二维码或直接从历史记录打开小程序，选择结束停车，调起微信支付，停车场摄像头识别车牌号码，打开闸门放行。到地面接了几个同事一起到亿达广场找吃的，附近没有停车场就随便找了一个空地停车。下车之后看到一个硕大的广告牌：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/QHGTAkCyj0cxGvjQOW8V.png" alt="" width="599" height="266"></p> <p>探鸟搞特价耶，赶紧扫码打开探鸟的小程序二维码，点击排队按钮，提示前面还有5个人，不错很快到了，等到还有 2 个人的时候，小程序提示我可以点餐下单了，那我们 5 个人就点两只鸡吧，应该够饱了。</p> <p>因为喝了点酒，喝酒不开车，吃饱之后，打开杜杜出行叫代驾。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/CvuUVRRDJjUlmjB1ouJ8.jpg" alt="" width="304" height="342"></p> <p>去取车的时候发现，握草！有一张违停罚单……醉了，扫一下上面的二维码，打开了**交警的小程序二维码，输出车牌号码，系统自动拉出罚单列表，单击刚刚的违停罚单，用微信支付完成了缴费。所以各位老司机不要乱停车哦。</p> <p style="text-align: center;">…………………………………以上故事纯属虚构…………………………………………</p> <h2>五、该不该做小程序</h2> <p>去年年初我写过一篇文章《应用号可以干翻应用商店？你想太多了吧》有说到过这个问题，那么如今小程序正式推出，我们再来探讨一下。</p> <h3><strong>&lt;重后端，轻前端&gt; 的思想在商业上的实践</strong></h3> <p>重后端，轻前端是技术架构上一种策略，因为前端代码更容易被反编译和破解，所以很多核心逻辑和算法放在服务器后台运行。在商业环境中，其实这种想法也非常适用。</p> <p>回顾一下人类发展过程各种“前端”的呈现形式：</p> <blockquote><p>龟甲、兽骨、竹简、木牍、金石、缣帛——纸张——PC 电脑web网页——黑白屏手机短信——智能手机时代的 iOS、安卓 APP——移动端 H5——公众号服务号、小程序——智能眼镜——智能硬件上的显示屏——直接把信息输入大脑</p></blockquote> <p>这些东西都在飞速变化，而不变的是什么？信息本身的价值、对信息处理、以及核心服务的价值是不变的。一千年前你去餐馆为了吃饭，今天你去餐馆也是为了吃饭；10年前你去酒店为了 xxoo，今天你去还是为了xxoo；更多时候我们应该注重自身服务和商业的闭环，无论是 app 还是小程序，他只是一种呈现形式，如果你饭馆的菜非常难吃，那么不管你把自己发布到饿了吧外卖平台、小众点评亦或是赶时髦做个小程序，依然没什么人去关顾你的餐厅。</p> <p>专心做你的核心服务，其他的交给第三方去做，他们有规模优势自然能做得更好更便宜。</p> <h3><strong>小程序、H5 的区别</strong></h3> <p>正如上文“小程序真面目”那一章所说的，微信小程序就是一个缓存到本地的网页。</p> <p><strong>为什么小程序比 H5 流畅和酷炫啊？</strong></p> <p>因为小程序缓存到了本地，在二次打开的时候无需要再加载，但果真如此吗？如果小程序开发者把很多图片、文字等页面元素都做成动态加载且不做缓存，那么你每次打开小程序相当于……重新下载了一遍 app，跟原来的 H5是一样的。</p> <p><strong>但是原来 H5的页面切换不流畅总是要加载，小程序不会啊，你怎么能说小程序和 H5一样呢？</strong></p> <p>原因在于之前大部分外包开发商更倾向于一个个单独页面写，页面逻辑混乱，当要跳转到新的页面就得重新向服务器请求一个页面，极其恶心。</p> <p>随着 vue 等前端框架的普及，越来越多的 SPA 架构网页应用出现，微信小程序应该就是基于此种技术，使用 SPA 架构的应用只需要在刚开始的时候 loading 加载，切换到应用内的其他页面不需要再加载新的页面，所以非常流畅。<strong>那是不是说明我们可以不做小程序而用 vue 来写就可以了？</strong></p> <p>也不是的，小程序比 H5多了很多入口，对于传统商户来说，找个外包商重新用 vue 写一个微官网的成本和找个外包商做一个小程序的成本是一样的，甚至比做小程序成本还高。因为小程序如此火热，肯定有大量第三方开发商做成各个行业的小程序模板，你只要稍微配置就能一键生成，成本是非常低的。</p> <p><strong>但是小程序比 H5多了很多原生的能力不是吗？</strong></p> <p>微信之前也有开放一个 JSSDK, 也有分享接口、图像接口、音频接口、设备信息、摇一摇、扫一扫等能力可以在移动 H5端去使用，小程序的优势在于比 JSSDK 多了更多的数据储存能力，比如视频、图片、音频等可以等用户在 wifi 环境下保存到本地，然后移动网络时候就可以离线观看了。但 JSSDK 开放这些能力的话也可以做到，只不过微信无形之后帮你规范好了，让你以 SPA 架构 去搭建一个网页，这正是小程序在技术层面上做的事情。</p> <p><strong>还有其他区别吗？</strong></p> <ol> <li>小程序诸多微信审核的限制、H5 不受微信管控</li> <li>小程序更容易打开，对于用户来说是不利的，因为东西不管你用不用总是占着手机空间；对于商家来说，二次使用成本更低，利用用户再次使用</li> </ol> <p><strong>各有各的优势，那我想两种都做会成本很高吗？</strong></p> <p>如果你原来的网页应用就是用 vue 那套框架构建的，那么再做到微信小程序的成本非常低，需要做一些转换和适配，比如 vue 的自定义标签功能定义成微信小程序的 <code>view</code> , 相信开源社区日后会有人贡献这些转化的代码。如果你原来的网页不是 SPA 架构的，那么就建议找第三方开发商来做小程序，成本低，虽然会比较多限制。有精力或者想得到更多能力，可以再逐步向刚刚说的，做一些工具完成网页应用到小程序的桥接转换。</p> <h3><strong>红利期在哪 ？</strong></h3> <p>2017年微信公开课Pro版上，男神张小龙对小程序做了一番详细的解析和解答。在此之前，很多人认为微信小程序会带来一波流量上的红利，但张小龙告诉大家，小程序在微信上没有入口、不能订阅，想要通过小程序来获取红利的人，想必是要失望了。</p> <p>但是果真如此吗？</p> <p>回想十九世纪四五十年代美国西进运动过程中的淘金热，我们也许更容易理解。淘金热中最终获利的其实不是淘金的人，而是船夫、卖水和卖铲子等为淘金提供支持的人。如果小程序引发一场”淘金热”，那它最大的红利可能就不是小程序本身。它会是什么呢？</p> <p>我觉得是以下几个方面：</p> <p><strong>1、第三方外包开发商</strong></p> <p>目前市面上外包一个简单商城的小程序价格大概在300到1000左右，对于个人开发者而言，这基本上是无利可图的，很少个人会去专门定制。对于灵活度要求较高，需要一些基础组件又需要定制开发的公司来说，更需要一个能规模化输出基础组件，并且在这基础上为部分公司定制开发的第三方服务商。这适合企业号那一波红利做得好的一些开发商，很可能成为同样主打企业用户的小程序，比如微信公开课 pro 上拿了“2016年度微信电子发票优秀合作伙伴”奖项的企微云平台。</p> <p><strong>2、自动生成小程序的</strong></p> <p>尽管微信小程序的开发门槛相比APP的开发门槛大幅降低，但带来的问题是：开发者需要适应和学习它的这套语言标准，而且开发的应用是不能移植到其他应用里面的，只能在微信上运行。如果技术小白能零门槛通过拖拽或根据模板的形式就自动生成小程序，这将更大降低开发和使用门槛。但是此类平台灵活度不够。</p> <p>目前这一类的企业有微尘、有赞等。</p> <p><strong>3、提供后端数据托管服务的云服务商</strong></p> <p>小程序只是一个前端而已，整个开发涉及到企业认证、云端数据存储、ICP 域名备案等，对于单个企业来说非常繁琐。因此需要能提供一条龙后端托管服务的第三方平台。</p> <p>目前腾讯云就在做这个事情，阿里云应该是不会推出微信小程序托管服务的。</p> <p><strong>4、小程序开发和运营培训</strong></p> <p>尽管通过第三方外包或拖拽自动都能开发出小程序，但前者可能面临成本的问题，后者则可能不能定制出特别符合要求的小程序。那么最好的方案就是”自己动手，丰衣足食”。而提供小程序开发培训的机构，则可以因此获得收益。</p> <p><strong>5、小程序导航网</strong></p> <p>张小龙在公开课说了：”我们并不会存在一个小程序的商店，所以我们也并不会像外界所猜测的那样，做一个APP的分发商店”。既然微信不做，巨大的入口价值，自然就会有别人去做这件事。让别人记住那么多小程序的名字，每次想用的时候就去搜一下是很麻烦的，如果能把小程序汇总起来，想用的时候就去导航网站找，估计会方便很多。</p> <h3><strong>哪些程序不适合</strong></h3> <p><strong>1、依靠向外部输出流量以获得盈利的 App</strong></p> <p>比如今日头条、Zaker 等这类资讯 App，商业变现方式太单一，基本上都是广告，小程序并没有提供商业变现的方式，他们做小程序有些革自己命的感觉……但是可以提供一个轻量的小程序入口提高品牌曝光。</p> <p><strong>2、需要较多依赖系统原生能力的 App</strong></p> <p>举个例子：</p> <p>Workflow，一款通过剪切板等输入，然后设定好动作，既可以做分词、发送到邮箱、查询是否诈骗电话号码等等非常多的自定义工作流。workflow 需要获取用户剪切板内容，调起邮箱、印象笔记等第三方 app、打开网页等多种系统能力，而小程序不会向开发者暴露所有的系统 api，这跟小程序定位不符合。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/U9qKzPJuIYUUdtBNFqPM.jpg" alt="" width="356" height="633"></p> <p>还有一个例子，一款阅读app，叫作优读。这款产品想要解决的问题是如何从大量信息中筛选出有价值的内容，他们的思路是利用“牛人”推荐和机器算法来完成。他们为了方便用户去分享内容到优读上去，做了很多便捷操作，比如你在任意一个app内阅读内容，当你想要将这篇文章分享到优读时，只需要复制链接，然后下拉通知中心，就可以选择 收藏或分享文章了。这很便捷。但是完全不适合做小程序。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/zAz4atR9J4IhayGRjlQu.jpg" alt="" width="356" height="150"></p> <p><strong>3、需要占用较大储存空间的应用</strong></p> <p>这一类通常是视频和音频类应用，比如腾讯视频、网易云音乐等。用户使用这类应用的场景很大一部分是在移动环境下，他们会事先把歌曲或者电视剧缓存到本地。但是对于微信小程序10M 的存储限制根本无法满足。但网易云也可以把私人 FM 独立出来做一个小程序占坑。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/GmcGkH0ucKW1BLk1HiPa.jpg" alt="" width="486" height="80"></p> <p><strong>4、需要大型 3D 渲染的</strong></p> <p>这方面主要是游戏，一个游戏包一般都在10M 以上，小程序上做个页游都不行，只能搞个 flappy bird 了。</p> <p><strong>5、服务性弱、和线下场景关联弱的应用</strong></p> <p>比如印象笔记等工具型产品</p> <p><strong>6、自己 APP 都做不好的，你就别去凑小程序的热闹了</strong></p> <p>如果你做一个 app 都没人用做不起来，那么做了小程序也没人用。因为核心的是服务和价值，小程序的定位就是你自由流量的情况下让用户更便捷的接触到你的服务，而不是为了给你的服务引流。比如你租用了一堆广告牌，你有一家门店贴上小程序二维码，用户能更好的使用你提供的服务。如果你本身没流量入口，那么小程序也没有，和 app 一样依然推不动而且还没有留存。</p> <h3><strong>可以上架的小程序类目</strong></h3> <p>以下是小程序允许上架的服务类目及其需要的材料，从下图可以看出，微信对于政务服务、工具、出行、实体商户四个大类的细分是极其详细的，可以看出这是微信着力要发展的四个大类，一旦所有的政府机构都用上了小程序，那么很多我们必须用到的政务服务都必将刺激更多中老年用户去使用微信。另外出行是个高频需求，从 n 年前微信支付和支付宝争夺移动出行的入口就可见一斑。另外微信虽说不做导航，那么弄那么详细的分类干什么呢，即使所需的审核资料一致？令人深思。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/bd0KiAxsBAxRW8EKfGCQ.jpg" alt="" width="700" height="1227"></p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/tMljDq7eBPfK3ESOgi9E.jpg" alt="" width="701" height="1509"></p> <h2>六、一些要点</h2> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/nceuMBijHG9GSqTatJJq.jpg" alt="" width="600" height="308"></p> <h3><strong>一些数字</strong></h3> <ul> <li>1 个营业执照能注册 50 个小程序</li> <li>1 个小程序必须绑定 1 个管理员（含个人微信、手机号码、身份证）</li> <li>1 个身份证只能绑定 5 个小程序</li> <li>1 个公众号能绑定 5 个小程序</li> <li>1 个小程序只能对应 1 个公众号</li> </ul> <h3><strong>跳转引流能力有限</strong></h3> <p>小程序内不能跳转到对应的公众号也不能诱导关注公众号，但在小程序的介绍页会露出且点击可跳转绑定的公众号。可通过介绍页实现公众号和小程序之间的互相跳转，但网页内和聊天窗口内长按识别二维码不能打开小程序。</p> <h3><strong>安卓的小程序能放到桌面，iOS目前不可以</strong></h3> <p>但不排除之后会通过Safari书签的形式放到桌面上，技术层面是可以实现的，只是用户操作路径比安卓一键放到桌面麻烦。</p> <h3><strong>页面内不能出现引导下载你自己App的文字</strong></h3> <p>微信官方文档​5.1：</p> <ul> <li>微信小程序的页面内容中，不得存在诱导类行为，包括但不限于诱导分享、诱导添加、诱导关注、诱导下载等；如不得要求用户分享、添加、关注或下载后才可操作；</li> <li>不得含有明示或暗示用户分享的文案、图片、按钮、浮层、弹窗等；</li> <li>不得通过利益诱惑诱导用户分享、传播；不得用夸张言语来胁迫、引诱用户分享；不得强制或诱导用户添加小程序。</li> </ul> <h3><strong>只有管理员能上传代码</strong></h3> <p>开发者无法上传</p> <h3><strong>任意页面可以带参数生成二维码，最多十万个</strong></h3> <p>这就很有想象力了，在床头贴一个 Jinkey 智能管家的小程序二维码，带一个参数 action = closeLight ，扫码后自动关灯；</p> <p>在门口放一个 Jinkey 智能管家的小程序二维码，带一个参数 action = out ，出门扫描一下自动关闭家里的电源总开关（额，除了冰箱）。</p> <p>在厕所放一个二维码，action = focus，扫描自动关注微信公众号 jinkey-love。</p> <p>同样的道理，带参数的二维码可用于线下商家、政府服务的小程序内不同功能区直接进入对应的服务而不需要使用多个小程序。比如去银行扫描一个取号机上的二维码取号，金银柜台扫码了解各种理财产品。</p> <h3><strong>小心手机空间和流量不足</strong></h3> <p>小程序并非不用下载，而是在你首次使用的时候会下发一个包，相当于把网页缓存好，下次打开就快了，但是但是…你已经下载了，而且是“不需要确认的下载”，点开即下载，然后你的流量就哗啦啦呼啦啦…下图是微信小程序下载的页面，不过在正式版中，微信已经去掉了“数据下载中，请稍候…”的文字，但依然是下载哦。所以微信所说的“免下载”更多地只是一种“无感下载”。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/b7wMoeLeoRXvV2ezGi0I.jpg" alt="" width="304" height="540"></p> <h3><strong>小程序空间有限</strong></h3> <p>整个小程序包的上传时的体积不能超过1M，加载到用户手机后，缓存大小不能超过10M（有可能被清除掉），永久存储大小不能超过10M（下次进来还能打开）</p> <h3><strong>名字、头像要慎重</strong></h3> <p>小程序的名称1年可以修改1次、头像1个月可以修改5次、小程序介绍1个月可以修改5次。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/DCCcXsOk8wPGrElG5V73.png" alt="" width="701" height="431"></p> <h2>七、小程序的能力</h2> <p>为什么要了解这部分内容？</p> <ol> <li>知道什么页面元素是微信小程序自带的，能快速开发上线</li> <li>知道有哪些异常流和节点产品经理提需求，老板决策的时候可以发挥的</li> <li>知道有哪些硬件能力提供，知道产品的边界所在？<strong>比如你想做一个 NFC 刷卡坐地铁的小程序，那么很遗憾告诉你，小程序做不了，甚至 iOS 都没有开放到NFC 的能力给开发者，所以小程序现在不会有 NFC 能力。</strong></li> </ol> <h3><strong>默认组件</strong></h3> <p>有哪些组件？</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/iXLaaGR1Ct3DYgqEZ6tZ.jpg" alt="" width="802" height="415"></p> <p>组件长什么样子的？</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/hARAajehY4qCq3TmQNB2.jpg" alt="" width="801" height="670"></p> <p>当然，小程序本身只是一个网页，你可以使用通过 css 自定义组件的样式或者自己写一些特殊的组件，比如电商购物车的步进计数器。</p> <h3><strong>事件钩子（建议非产品经理、运营等需求提出方跳过钩子和事件这部分）</strong></h3> <p><strong>1. 什么是钩子？</strong></p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/sIgnm42SNJa6qnJ3k34G.jpg" alt="" width="801" height="453"></p> <p>一只小乌龟的头上顶着数字 7 和 8（额，好像没什么不对的），他需要走过一个装着加法运算器的箱子，之后头上就会变成一个数字 15。那么这个箱子就称为一个钩子函数，如果放在里面的是一个乘法运算器，那么小乌龟的头上的数字经过正方体之后就会变成56。</p> <p>小程序相当于那只小乌龟，在运行时（小乌龟走路）会触发很多的事件（钩子函数，相当于小乌龟经过的正方体），往这些正方体里面放入什么逻辑，取决于坑比的产品经理。</p> <p>比如一个电商的步进计数器改变值的时候：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/7sOgVFGXdr0KERlZsyac.jpg" alt="" width="321" height="121"></p> <p><strong>2. 有哪些钩子</strong></p> <p>App 生命周期的钩子</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/gbctyOan4eUMa64D93ZY.jpg" alt="" width="802" height="449"></p> <p>小程序的生命周期分为<strong>程序</strong>和<strong>页面</strong>两个部分：</p> <p>程序有启动（未显示）、显示出来了和隐藏三个事件</p> <p>页面有加载、显示出来了、准备好了（首次）、卸载页面、隐藏页面五个事件</p> <p>除此之外，还有 <code>onPullDownRefresh</code> 下拉刷新的时候、 <code>onReachBottom</code> 上拉无限加载的时候、 <code>onShareAppMessage</code> 点击右上角分享按钮的时候。</p> <p>其中我觉得 <code>onShareAppMessage</code> 是挺有用的，比如当用户点击右上角分享按钮时，往页面顶层覆盖一个分享图（高度为页面高度80%），这样子会改变页面分享到聊天窗口的样子（这里还没实践过，只是猜想，你们可以自己试试）</p> <p><strong>3. 触摸事件</strong></p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/O76HcgSYk5NLSQroFmDx.jpg" alt="" width="792" height="445"></p> <p>分为<strong>点击、长按、触摸开始、触摸移动</strong>（比如可用于拖拽排列列表）、<strong>触摸结束、触摸取消</strong>（比如一个看视频的小程序要求你两只手都按着手机才能播放，在你看到快高潮的时候，女朋友打电话来，就会触发 <code>touchcancel</code> 事件）<br> <strong>4. 组件事件</strong></p> <p>组件事件主要有几种：值改变的事件、开始输入的事件、完成输入的事件。</p> <p>举个例子，比如一个文本框要求输入邮箱，因为当用户输入时会触发 input 事件，所以可以绑定一个钩子函数，获取到用户每次输入的字符串判断一下是否含有“@”和”.”，若有则判定为合法。</p> <p>其他详细的可以看下图用于自查。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/72IHd2tSZR9fneDYldww.jpg" alt="" width="798" height="360"></p> <p><strong>5. 富媒体事件</strong><br> 富媒体的事件主要有几种：开始（加载）播放、暂停播放、结束播放、播放（加载）失败、播放进度更新这几种。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/nLcl5TpMMyYSMmm34DVd.jpg" alt="" width="801" height="309"></p> <p><strong>6. 硬件能力</strong></p> <ol> <li>从本地相册选取照片视频</li> <li>拍照或录像</li> <li>扫描二维码</li> <li>录制语音</li> <li>直接打开doc, xls, ppt, pdf, docx, xlsx, pptx</li> <li>保存文件到微信 app 目录</li> <li>获取地理位置</li> <li>获取用户手机型号、设备像素比、窗口宽高、语言、微信版本号、操作系统版本、客户端平台</li> <li>获取网络状态：2g，3g，4g，wifi</li> <li>监听重力感应器，5次/秒，可以做摇一摇等</li> <li>监听罗盘数据，5次/秒</li> <li>直接拨打电话（企业宣传留个咨询电话）</li> </ol> <p><strong>7. 微信能力</strong></p> <p>（1）微信登录</p> <p>（2）获取用户的头像、昵称、性别、国家、城市、省份</p> <p>（3）微信支付</p> <p>（4）模板消息</p> <p>只有以下两种行为可以触发模板消息</p> <ul> <li><strong>支付</strong>当用户在小程序内完成过支付行为，可允许开发者向用户在7天内推送有限条数的模板消息（1次支付可下发1条，多次支付下发条数独立，互相不影响）</li> <li><strong>提交表单</strong>当用户在小程序内发生过提交表单行为且该表单声明为要发模板消息的，开发者需要向用户提供服务时，可允许开发者向用户在7天内推送有限条数的模板消息（1次提交表单可下发1条，多次提交下发条数独立，相互不影响）</li> </ul> <p>（5）客服消息</p> <p>用户通过客服消息按钮进入会话，1分钟内可下发1条消息，超时不能发送；</p> <p>用户在客服窗口发送信息，可回复 3 条且需要 48 小时内回复</p> <p>（6）分享到聊天窗口</p> <p>分享图片不能自定义；会取当前页面，从顶部开始，高度为 80% 屏幕宽度的图像作为分享图片。</p> <h3><strong>#专栏作家#</strong></h3> <p>Jinkey，原腾讯手机管家产品运营，原拍拍、微信购物产品经理。P-1级产品菜鸟，分享产品心得，技术科普。专注于社交产品、企业级产品、机器学习和 iOS 开发，公众号 jinkey-love，欢迎交流。</p> <p>本文原创发布于人人都是产品经理。未经许可，禁止转载。</p> </div>'
    },
    {
        "id": 3,
        "name": '在体验设计中，如何理解用户思路以构造良好的用户体验？',
        "url": 'news3.jpg',
        "developer": '中人PM',
        "date": '2017/01/12',
        "sinfo": '良好的用户体验是一款产品必须追求并努力的方向，那么在产品设计中如何理解用户的思路，构建良好的用户体验？文章从角色、需要、流程三个方面展开来进行用户心理、行为...',
        "info": '<div class="entry-content"> <blockquote><p>良好的用户体验是一款产品必须追求并努力的方向，那么在产品设计中如何理解用户的思路，构建良好的用户体验？文章从角色、需要、流程三个方面展开来进行用户心理、行为的解析。希望大家能够有所启发。</p></blockquote> <p><img data-action="zoom" class="size-full wp-image-575171 aligncenter" src="http://image.woshipm.com/wp-files/2017/01/JZG9mnu5VCgeKuVaQT7z.jpg" alt="" width="680" height="320"></p> <p>身作产品从业者，不难理解到体验设计是贯穿整个产品的生命周期的一项细活。每个产品人员也期望设计出不同寻常的体验，我个人也是从事产品三年有余的中老年人了，今天向一些刚入行的产品们分享几点我个人觉着在工作过程中很重要的几点体验设计的思路点。</p> <p>之前拿自己经验，写了一篇<a href="http://www.woshipm.com/pmd/478512.html" target="_blank">《前、后端产品差异对比分析》</a>的文章，该文侧重点在于产品从事方向上的对比分析，发现阅读效果不错，于是更有动力的写了这篇文章，侧重点在于体验设计中需要怎样的理解用户思路，或者反过来讲，如何理解用户才会对体验设计更有意义。（篇中是大体的图，具体的需要自己脑补哦~）</p> <p>为了便于大家理解，以及有序的记忆。我将对用户的理解依次列为：<strong>角色、需要、流程</strong>三个大块进行描述。</p> <h2><strong>一、用户的角色</strong></h2> <p>用户的角色是用户使用产品时的一种立场。立场不同，看产品、使用产品的侧重点则不同。很多时候产品人员需要形成一个用户画像，那么角色就是这个画像中的一部分。</p> <p>明星的角色和追星族是不同的，追求名牌的和不讲究的又是不同，男女不同，老少不同，管理者和执行者不同，买家和卖家不同等等。例如，你的网站是一个肿瘤医院的网站，那么可以通过以往医院就医的经验得出：大部分用户都是45~60岁的人，普遍年收入不会很高，常见疾病暴发群体是吸烟者，这些用户普遍对互联网的使用经验不足，喜欢简单、便捷的网站布局（以上仅仅为举例，描述未必准确）。常用的区分角色的维度：地域分布、兴趣分布、社会阶级、收入情况、年龄阶段、文化水平等等。</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/UNLBi9wvBghstlS66sqH.png" alt="" width="599" height="200"></p> <p>产品去满足这些不同角色时会发现，往往相同的角色即会有相似的需求。这也是分析需求时必先进行的一步。这一步做好归纳，接下来的需求才能做到全面，不易疏漏。也是对于做产品的人而言，利于理清思路，不会混为一谈。</p> <p><strong>总结“用户的角色”的特点，即：身份、聚类。</strong></p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/7tMNbyBmCZtDwKHsbGgU.png" alt="" width="571" height="494"></p> <p>&nbsp;</p> <h2><strong>二、用户的需要</strong></h2> <h3><strong>既全面又重点。</strong></h3> <p>“需要”是方向，用户的需要被满足，才是用户来到这个产品的原因、动力。</p> <p>产品人员需要先全面考虑用户所需要的有哪些，形成需求池。在做产品时，不可平均思维，毕竟产品的可用空间有限；再者，用户的认知、判断的精力、耐心有限，不能全面的一盘接受产品的功能，所以需要把其中的重点列在首位、易察位置，优先呈现。对于判断重点的方法，常见的有：公司主推的功能、用户高频的、收益性强的等思路维度。</p> <h3><strong>系统对“需要”的约束</strong>。</h3> <p>其实，做产品仅仅去满足用户的目的、需要可能还不够，至少遇到更高层面设计产品时是不够的。要懂得用户的意识、心理。这方面要理性的从系统层面去看：系统的放任是否会给用户的各种各样的“需要”提供更多的自由发挥的空间，如此一来，会不会给系统带来无序干扰、良莠不齐，最终乱木丛生？所以，要从系统层面对用户的需要进行约束、规定，才会让整个系统中的用户用得有规矩、良性的生长。微信就是这样，苹果iOS也是如此，打造的就是一个安全、有序、审核严格的系统。</p> <p><strong>总结“需要”的特点，即：全面、主次、有约束。</strong></p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/tVXZYlzcHZZ6cAIOS3ru.png" alt="" width="603" height="261"></p> <h2>三、用户的使用流程</h2> <h3><strong>流程中“目的”的同一</strong></h3> <p>当用户在完成一个需要的过程中，其实就是带有着目的的，需要顺从用户的目的，不要中间加入其他而干扰目的，不让用户同时进行多种目的，或者，不要在页面中加入过多其他功能的入口，以免用户无意识的转换目的，影响本来流程中间断裂，造成流量分流。</p> <p>“目的”在实现过程中的完整性、同一性非常重要，对于用户而言这是一种顺畅、一气呵成之感。对产品而言，也会有集中用户注意力，便于流量疏导，提升转化率的效果。</p> <h3><strong>预期判断准确</strong></h3> <p>“预期判断”更多倾向于展示。一个操作过程中，是否能让用户感到操作过程的透明，没有盲区，了解自己处于什么状态、步骤，已做过了什么，还剩下什么与自己相关的？是否能让用户很轻松的判断出功能、页面是不是自己需要的，产品想表达的是不是能让一个不知内幕的用户一目神会？</p> <p>用户的预期一向是有惯性的，尤其是在改版后新功能上线时的缓冲、引导。</p> <h3><strong>体验成本</strong></h3> <p>“体验成本”是对产品的使用完成目的整个过程所用的成本。用户在这个产品里面怎么做的、流程是什么和花费了多长时间等，这些都会是用户对这个产品的一个体验成本。</p> <p>用户是懒惰的、耐心有限的。需要简化、突出重点，包括简化流程，更多放在后台判断，文案提示、交互、UI简化扼要，如果有精准的个性推荐会更好。</p> <p>当然，用户的清晰认知只是一个进来的动作，具体的还需要再看进来后是不是整得能解决问题。每一个过程、操作都是有效的，有意义的，针对用户的需要的。试想如果一个再好的事物呈现在用户面前时，如果用户认识不清楚、不迅速，那么再好的也会打折，甚至用户未明却已远离。所以，清晰非常重要。清晰主要包括：内容的易识别，层次等级明显等等。</p> <p>好的体验各有各的好，但有一点一定是相同的，即：清晰。</p> <p><strong>总结使用流程的特点，即：同一、透明、清晰、简捷。</strong></p> <p>由于时间原因，以上就是个人挑选了几个比较重要的点给大家做一个分享，而且图片和文字也描述得可能比较笼统、偏向理论，没那么多时间给大家多查资料，多举例子，希望大家不耐其烦。</p> <p>看文章更重要的还是理解后的活用。在做项目过程中一点点的总结思路，同时也要去运用所总结的思路，越用越活、越活越好用。</p> <p>有问题，希望大家多评论。</p> <p>&nbsp;</p> <p>本文由 @中人PM 原创发布于人人都是产品经理。未经许可，禁止转载。</p> </div>',
    },
    {
        "id": 4,
        "name": '实例分析：在产品设计中如何运用产品经理的逻辑思维？',
        "url": 'news4.jpg',
        "developer": '朱帝',
        "date": '2017/01/12',
        "sinfo": '产品经理需要的思维很多，比如：逻辑思维，用户思维，市场思维，还有万能的互联网思维。这篇文章来聊聊个人觉得最基础也是也最核心的逻辑思维。文章主要分为两部分，...',
        "info": '<div class="entry-content"> <blockquote><p>产品经理需要的思维很多，比如：逻辑思维，用户思维，市场思维，还有万能的互联网思维。这篇文章来聊聊个人觉得最基础也是也最核心的逻辑思维。</p></blockquote> <p><img data-action="zoom" class="size-full wp-image-575159 aligncenter" src="http://image.woshipm.com/wp-files/2017/01/2bxcsXp32hGsF4G3d2ou.jpg" alt="" width="680" height="320"></p> <p>文章主要分为两部分，第一部分为逻辑思维的介绍以及思考的流程和方法，第二部分用个人曾经负责过的产品案例来详细说明。</p> <h2>结构思考力</h2> <p>前段时间看完一本书，名字是《结构思考力》，看完觉得书中提供的思维方式是每个产品经理都应该掌握的。因为产品经理在工作中往往面对的环境是复杂的，不是非黑即白的，需要从多方面的因素是考虑去平衡，从而才能知道当前阶段应该做什么，不应该做什么。</p> <p>结构思考力换个名称大家会更熟悉，那就是金字塔思维。核心内容是：</p> <h3><strong>基本结构：</strong></h3> <p>结论先行，以上统下，归类分组，逻辑递进。</p> <p>先重要后次要，先总结后具体，先框架后细节，先结论后原因，先结果后过程，先论点后论据。</p> <h3><strong>具体做法：</strong></h3> <p>自上而下表达，自下而上思考，纵向总结概括，横向归类分组。</p> <p>用一张图表示金字塔思维的基本逻辑：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/Q3E90FZkGkQdeM0Iqc2y.png" alt="" width="536" height="301"></p> <p><strong>纵向结构分层次：</strong></p> <ul> <li>结论先行，以上统下</li> <li>先表明结果，在针对结果做分解，列出可能造成的原因</li> </ul> <p><strong>横向结构选顺序：</strong></p> <p>归类分组，逻辑递进</p> <p><b>MECE:</b></p> <ul> <li>相互独立，完全穷尽</li> <li>多思考，是否还有遗漏的因素，是否把所有可能的因素都考虑到了</li> <li>列出来的因素是否有重叠的，如果有，则去重</li> </ul> <p><b>归纳、演绎：</b></p> <ul> <li>归纳：把具备某种相同属性的事物排列出来</li> <li>演绎：从前提必然地得出结论的推理；从一些假设的命题出发，运用逻辑的规则，导出另一命题的过程</li> </ul> <p>通常 MECE 和归纳演绎会配合使用，相互联系，互为条件，相互补充、相互转化的。</p> <h2>以笔者曾经负责的一款产品为例</h2> <p>之前创业时，老板想做一款“让用户在移动端就能预约线下母婴店洗澡/游泳等服务的 APP”，这里不讨论需求是否合理、是否高频刚需等，只从产品设计层面来考虑。</p> <p>根据要求，可分为两个主体，分别是：商家端和用户端。平台端主要支撑两端运行，不做太多讨论。</p> <h3><b>商家端：</b></h3> <p>核心要点包括如下：</p> <ol> <li>线下商家入驻平台需要提供什么资料？</li> <li>线下的服务如何呈现到线上让用户查看并预约？</li> <li>什么样的用户才能够在 APP 端预约线下店的服务？</li> <li>用户在什么时间段去线下店服务？</li> <li>线下店的收入怎么才能到商家账户？</li> <li>其他，如：商铺点评，服务点评等后续的功能</li> </ol> <p><strong>1、线下商家入驻平台需要提供什么资料？</strong></p> <p>此功能的目的是审核店铺的真伪，记录店铺的主要信息，并且对审核后的状态需及时告知商家，只有成功的商家才能继续后续的服务操作。</p> <p>主要信息包含：店主姓名、营业执照照片、身份证正反面照片、联系方式</p> <p>审核状态：审核成功、审核失败、审核中</p> <p><strong>2、线下的服务如何呈现到线上让用户查看并预约？</strong></p> <p>此功能的设计需要深入了解线下店原来的服务。主要有洗澡、游泳、按摩几种，其中洗澡时最高频且刚需的，因此我们只针对洗澡提供服务。</p> <p>线下店全部采用会员卡的形式去消费，会员卡有月卡、年卡、次卡三种，月卡和年卡是从开卡当天开始计算。时间到达卡则失效。</p> <p>因此，需要提供让商家自由设置不同的卡、不同的金额和有效期的功能</p> <p><strong>3、什么样的用户才能够在 APP 端预约线下店的服务？</strong></p> <p>因为线下店全部采用会员制，因此必须先办理某个店铺的会员卡成为会员后才能享受到该店铺提供的服务。非会员用户不可享受。</p> <p><strong>4、用户在什么时间段去线下店服务？</strong></p> <p>为了减少用户的排队的时间，商家需根据店铺的实际服务情况确定店铺最大同时服务人数。</p> <p>因此，在功能上，提供给商家不同时间段和最大服务人数的功能。</p> <p><strong>5、费用怎么结算给商家？</strong></p> <p>用户办理的会员卡的费用全部统一到平台的支付宝账户，平台在每个月5号统计上个月该店铺收到的总会员费用，商家需能查看办理会员卡的流水金额，因为要和商家结账，因此需要商家提供支付宝账户。</p> <p>结算状态：已结算，未结算</p> <p><strong>6、其他，如：商铺点评，服务点评等后续的功能</strong></p> <p>后续版本会做，前期只考虑模式的可行性。</p> <p>用思维导图整理出来：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/jb0DyQjPpeP4AVT1ACX7.png" alt="" width="603" height="632"></p> <h3><b>用户端：</b></h3> <p>O2O 的产品，主要体现在线下，因此线上的功能相对简单，主要做一些信息的展示和简单的操作。</p> <p>核心点如下：</p> <ol> <li>用户如何知道附近有哪些线下店？</li> <li>用户怎么支付会员卡的费用？</li> <li>用户如何预约线下店的服务？</li> <li>预约会遇到哪些情况？</li> </ol> <p><strong>1、用户怎么获取线下店？</strong></p> <p>两种方式，两种场景，分别是：通过 LBS 获取和输入店铺 ID 搜索。</p> <p><strong>LBS：</strong>这是一款 O2O 的产品，可根据用户的地理位置获取附近的店铺。基于地理位置给用户展示附近的店铺。供用户查看店铺信息并做出决策</p> <p><strong>搜索：</strong>这是比较传统的方式，很多用户会直接到线下店服务，因此提供快速的通过店铺 ID 搜索店铺的方式</p> <p><strong>2、用户怎么支付会员卡的费用？</strong></p> <p>之前已经介绍过商家的业务，都是采用办理会员卡的形式，办理后在有效时间内直接就可以预约就可享受到服务，因此费用都是一次支付，长期有效。</p> <p>而支付的形式则和大多数 APP 一样，使用第三方支付，微信、支付宝。</p> <p><strong>3、用户如何预约线下店的服务？</strong></p> <p>大家都有在APP 里预定过电影票，预约服务和电影类似，用户自己选择日期和时间段（类似于场次），平台会显示当前时间段是否有剩余人数，如果有，则可预约，反之只能更换时间。</p> <p>次卡当预约后则扣除次数。</p> <p><strong>4、预约会遇到哪些情况？</strong></p> <p>预约可能出现的情况其实和电商的订单类似，包括但不局限于：</p> <ul> <li>预约都满了怎么办？</li> <li>预约了不去服务怎么办?</li> </ul> <p>用思维导图整理：</p> <p><img data-action="zoom" class="aligncenter" src="http://image.woshipm.com/wp-files/2017/01/i30zrl7bRofPJAFOKh6Q.png" alt="" width="613" height="383"></p> <p>至此，核心业务流程基本已经完成，剩下的就是细化流程。</p> <p>对于金字塔思维的方式，不仅能够使用与以上的业务逻辑，也适用于功能的逻辑，以微信发信息举例：</p> <p>输入内容后并发送：</p> <p><strong>1.当前有网络</strong></p> <ul> <li>发送中：菊花一直再转</li> <li>发送失败：红色 icon 提示，点击继续发送</li> <li>发送成功：正常状态</li> </ul> <p><strong>2.当前无网络</strong></p> <p>菊花一直转，直到恢复网络时重复1的流程。</p> <p>就酱紫。</p> <p>&nbsp;</p> <p>本文由人人都是产品经理团队@朱帝（微信：434826236） 原创发布，未经许可，不得转载。</p> </div>',
    },

]